app/views/search/search.html.erb

SELECT "books".* FROM "books" WHERE (title like'%te%')
SELECT "users".* FROM "users" WHERE (name LIKE '%mo%')
---
<%= form_with url: search_path, method: :get, local: :true do |f| %>
  <%= f.select :range, options_for_select([['User'], ['Book']]) %><!--UserとBookの切り替えプルダウン-->