app/views/users/index.html.erb

SELECT "users".* FROM "users"
---
<%= form_with url: search_path, method: :get, local: :true do |f| %>
  <%= f.select :range, options_for_select([['User'], ['Book']]) %><!--UserとBookの切り替えプルダウン-->