app/views/books/_favorite.html.erb

    <%= link_to book_favorite_path(book), method: :delete,remote: true do %>
      ♥<%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

    <%= link_to book_favorite_path(book), method: :post,remote: true do %>
      ♡<%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]