app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "test"], ["body", "sssssss"], ["user_id", 1], ["created_at", "2021-06-03 11:47:38.293031"], ["updated_at", "2021-06-03 11:47:38.293031"]]