app/controllers/users_controller.rb

  def show
    #@users = User.all
    #@user_book = @Users.find(params[:id])
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]